const users = {
    "كيرلس أمين": "14085",
    "بولا يوسف": "15874",
    "أمين كيرلس": "18754",
    "يوسف بولا": "80255",
    "يوسف بولا": "80255",
    "يوسف بولا": "80255",
    "يوسف بولا": "80255",
    "يوسف بولا": "80255",
    "يوسف بولا": "80255",
    "يوسف بولا": "80255",
    "يوسف بولا": "80255",
    "يوسف بولا": "80255",
    "يوس بولا": "80255",
    "يوسف بولا": "80255",
    "يوسف بوا": "80255",
    "بسنت هاني": "44444",
    "يوسف بولا": "80255",
    "يوسفبولا": "80255",
    "يوسف بولا": "80255",
    "يوسف بولا": "80255",
    "يوسف بولا": "80255",
    "يوسبولا": "80255",
    "يوسف بولا": "80255",
    "يوسف بولا": "80255",
    "يوسف بولا": "80255",
    "يوسف بولا": "80255",
    "يوسف بو": "80255",
    "يوسبولا": "80255",
    "يوسبولا": "80255",
    "يوسف بولا": "80255",
    "يوسف بولا": "80255",
    "يوسف بولا": "80255",
    "يوسف بولا": "80255",
    "يوسف بولا": "80255",
    "يوسف بولا": "80255",
    "يوسف بولا": "80255",
    "يوسف بولا": "80255",
    "يوسف بولا": "80255",
    "يوسف بولا": "80255",
    "يوسف بولا": "80255",
    "يوسف بولا": "80255",
    "يوسف بولا": "80255",
    "يوسف بولا": "80255",
    "يوسف بولا": "80255",
    "يوسف بولا": "80255",
    "يوسف بولا": "80255",
    "يوسف بولا": "80255",
    "يوسف بولا": "80255",
    "يوسف بولا": "80255",
    "يوسف بولا": "80255",
    "يوسف بولا": "80255",
    "يوسف بولا": "80255",
    "يوسف بولا": "80255",
    "يوسف بولا": "80255",
    "يوسف بولا": "80255",
    "يوسف بولا": "80255",
    "يوسف بولا": "80255",
    "يوسف بولا": "80255",
    "يوسف بولا": "80255",
    "يوسف بولا": "80255",
    "يوسف بولا": "80255",
    "يوسف بولا": "80255",
    "يوسف بولا": "80255",
    "يوسف بولا": "80255",
    "يوسف بولا": "80255",
    "يوسف بولا": "80255",
    "يوسف بولا": "80255",
    "يوسف بولا": "80255",
    "يوسف بولا": "80255",
    "يوسف بولا": "80255",
    "يوسف بولا": "80255",
    "يوسف بولا": "80255",
    "يوسف بولا": "80255",
    "يوسف بولا": "80255",
    "يوسف بولا": "80255",
    "يوسف بولا": "80255",
    "يوسف بولا": "80255",
    "يوسف بولا": "80255",
    "يوسف بولا": "80255",
    "يوسف بولا": "80255",
    "يوسف بولا": "80255",
    "يوسف بولا": "80255",
    "يوسف بولا": "80255",
    "يوسف بولا": "80255",
    "يوسف بولا": "80255",
    "يوسف بولا": "80255",
    "يوسف بولا": "80255",
    "يوسف بولا": "80255",
    "يوسف بولا": "80255",
    "يوسف بولا": "80255",
    "يوسف بولا": "80255",
    "يوسف بولا": "80255",
    "يوسف بولا": "80255",
    "يوسف بولا": "80255",
    "يوسف بولا": "80255",
    "يوسف بولا": "80255",
    "يوسف بولا": "80255",
    "يوسف بولا": "80255",
    "يوسف بولا": "80255",
    "يوسف بولا": "80255",
    "يوسف بولا": "80255",
    "يوسف بولا": "80255",
    "يوسف بولا": "80255",
    "يوسف بولا": "80255",
    "يوسف بولا": "80255",
    "يوسف بولا": "80255",
    "يوسف بولا": "80255",
    "يوسف بولا": "80255",
    "يوسف بولا": "80255",
    "يوسف بولا": "80255",
    "يوسف بولا": "80255",
    "يوسف بولا": "80255",
    "يوسف بولا": "80255",
    "يوسف بولا": "80255",
    "يوسف بولا": "80255",
    "يوسف بولا": "80255",
    "يوسف بولا": "80255",
    "يوسف بولا": "80255",
    "يوسف بولا": "80255",
    "يوسف بولا": "80255",
    "يوسف بولا": "80255",
    "يوسف بولا": "80255",
    "يوسف بولا": "80255",
    "يوسف بولا": "80255",
    "يوسف بولا": "80255",
    "يوسف بولا": "80255",
    "يوسف بولا": "80255",
    "يوسف بولا": "80255",
    "يوسف بولا": "80255",
    "يوسف بولا": "80255",
    "يوسف بولا": "80255",
    "يوسف بولا": "80255",
    "يوسف بولا": "80255",
    "يوسف بولا": "80255",
    "يوسف بولا": "80255",
    "يوسف بولا": "80255",
    "يوسف بولا": "80255",
    "يوسف بولا": "80255",
    "يوسف بولا": "80255",
    "يوسف بولا": "80255",
    "يوسف بولا": "80255",
    "يوسف بولا": "80255",
    "يوسف بولا": "80255",
    "يوسف بولا": "80255",
    "يوسف بولا": "80255",
    "يوسف بولا": "80255",
    "يوسف بولا": "80255",
    "يوسف بولا": "80255",
    "يوسف بولا": "80255",
    "يوسف بولا": "80255",
    "يوسف بولا": "80255",
    "يوسف بولا": "80255",
    "يوسف بولا": "80255",
    "يوسف بولا": "80255",
    "يوسف بولا": "80255",
    "يوسف بولا": "80255",
    "يوسف بولا": "80255",
    "يوسف بولا": "80255",
    "يوسف بولا": "80255",
    "بولا مينا": "81255",


























};

function login() {
    const usernameInput = document.getElementById("username").value;
    const passwordInput = document.getElementById("password").value;
    const message = document.getElementById("message");

    if (users[usernameInput] === passwordInput) {
        message.textContent = "تم تسجيل الدخول بنجاح!";
        message.style.color = "green";
        // توجيه المستخدم إلى الصفحة الأخرى
        window.location.href = "homepage.html"; // استبدل باسم الصفحة التي تريد الانتقال إليها
    } else {
        message.textContent = "اسم المستخدم أو كلمة المرور غير صحيحة!";
        message.style.color = "red";
    }
}